Repository: grm34/PyArchboot
Catalog: locales/*/LC_MESSAGES/PyArchboot.po
Languages: fr

source: use arrow keys to select an option
fr: utilisez les flèches du clavier pour sélectionner une option

source: all data on the selected drive will be lost !
fr: toutes les données du disque dur seront perdues !

source: installation successfull
fr: installation réussie

source: Do you wish to reboot your computer now
fr: Voulez-vous redémarrer l'ordinateur maintenant

source: update mirrorlist
fr: mise à jour de la liste des mirroirs

source: install Arch Linux base system
fr: installation du système de base

source: create file system table
fr: création du fichier FSTAB

source: set timezone [{timezone}]
fr: configuration du fuseau horaire [{timezone}]

source: set locale [{locale}]
fr: configuration du language [{locale}]

source: set virtual console [{keymap}]
fr: configuration de la console virtuelle [{keymap}]

source: set hostname [{hostname}]
fr: configuration du nom d'hôte [{hostname}]

source: set root password
fr: création du mot de passe root

source: create user {user}
fr: création de l'utilisateur {user}

source: set password for user {user}
fr: création du mot de passe pour l'utilisateur {user}

source: install network
fr: installation du réseau

source: install grub bootloader
fr: installation du chargeur de démarrage grub

source: install {name}
fr: installation de {name}

source: configure bootloader [systemd-boot]
fr: configuration du chargeur de démarrage [systemd-boot]

source: configure bootloader [grub2]
fr: configuration du chargeur de démarrage [grub2]

source: configure {desktop}
fr: configuration de {desktop}

source: configure {display}
fr: configuration de {display}

source: give root privilege to the user {user}
fr: donner les droits root à l'utilisateur {user}

source: add user {user} to all groups
fr: ajout de l'utilisateur {user} à tous les groupes

source: install {aur} AUR Helper
fr: installation de {aur} AUR Helper

source: clean pacman cache and delete unused dependencies
fr: nettoyage du cache et suppression des dépendences inutiles

source: Use already formatted partitions
fr: Utiliser des partitions déjà formatées

source: no drive detected !
fr: aucun disque dur détecté !

source: unreconized CPU !
fr: processeur non reconnu !

source: Invalid size for BOOT: {response} (e.q., 512M) Minimum [100M] Maximum [2G] Remaining [{drive_size}]
fr: Taille invalide pour BOOT: {response} (ex: 512M) Minimum [100M] Maximum [2G] Disponible [{drive_size}]

source: Invalid size for ROOT: {response} (e.q., 25G) Minimum [5G] Maximum [16T] Remaining [{available}]
fr: Taille invalide pour ROOT: {response} (ex: 25G) Minimum [5G] Maximum [16T] Disponible [{available}]

source: Invalid size for SWAP: {response} (e.q., 2G) Minimum [1G] Maximum [32G] Remaining [{available}]
fr: Taille invalide pour SWAP: {response} (ex: 2G) Minimum [1G] Maximum [32G] Disponible [{available}]

source: Invalid size for HOME: {response} (e.q., 100G) Minimum [4G] Maximum [16T] Remaining [{available}]
fr: Taille invalide pour HOME: {response} (ex: 100G) Minimum [4G] Maximum [16T] Disponible [{available}]

source: Invalid timezone: {response} (e.q., Europe/Paris)
fr: Fuseau horaire invalide: {response} (ex: Europe/Paris)

source: Invalid language code: {response} (e.q., fr_FR)
fr: Code langue invalide: {response} (ex: fr_FR)

source: Invalid hostname: {response} (e.q., my-computer)
fr: Nom d'hôte invalide: {response} (ex: mon-ordinateur)

source: Password should be at least 8 chars long with one letter and one digit !
fr: Minimum 8 charactères avec au moins une lettre et un chiffre !

source: Invalid username: {response} (e.q., JohnDoe)
fr: Nom d'utilisateur invalide: {response} (ex: Johnny)

source: no partition detected !
fr: aucune partition détectée !

source: Do you wish to install {extra}
fr: Voulez-vous installer {extra}

source: Select the drive to use
fr: Sélectionnez le disque dur à utiliser

source: Do you wish use Logical Volume Manager (LVM)
fr: Voulez-vous installer le gestionnaire de volumes logiques (LVM)

source: Do you wish to encrypt the drive (LVM on LUKS)
fr: Voulez-vous crypter le disque dur (LVM on LUKS)

source: Select optional partitions
fr: Sélectionnez les partitions facultatives

source: Enter desired size for boot partition
fr: Entrez la taille désirée pour la partition boot

source: Do you wish use free space for root partition
fr: Voulez-vous utiliser l'espace restant pour la partition root

source: Enter desired size for root partition
fr: Entrez la taille désirée pour la partition root

source: Enter desired size for swap partition
fr: Entrez la taille désirée pour la partition swap

source: Do you wish use free space for home partition
fr: Voulez-vous utiliser l'espace restant pour la partition home

source: Enter desired size for home partition
fr: Entrez la taille désirée pour la partition home

source: Select boot partition
fr: Sélectionnez la partition boot

source: Select root partition
fr: Sélectionnez la partition root

source: Select swap partition
fr: Sélectionnez la partition swap

source: Select home partition
fr: Sélectionnez la partition home

source: Select timezone
fr: Sélectionnez le fuseau horaire

source: Custom timezone
fr: Fuseau horaire personnalisé

source: Enter desired timezone
fr: Entrez le fuseau horaire désiré

source: Enter language code
fr: Entrez votre code langue

source: Enter hostname
fr: Entrez un nom d'hôte

source: Enter password for root
fr: Entrez un mot de passe pour root

source: Enter username
fr: Entrez votre nom d'utilisateur

source: Enter password for user {username}
fr: Entrez un mot de passe pour l'utilisateur {username}

source: Select Linux Kernel
fr: Sélectionnez le kernel désiré

source: Do you wish to install Linux Firmware
fr: Voulez-vous installer Linux Firmware

source: Select Desktop Environment
fr: Sélectionnez un environnement de bureau

source: Select Display Manager
fr: Sélectionnez un gestionnaire de connexion

source: Select LightDM Greeter
fr: Sélectionnez un greeter pour LightDM

source: Do you wish to install GPU driver
fr: Voulez vous installer les drivers graphique

source: Select GPU Controller
fr: Sélectionnez votre carte graphique

source: Do you wish to install Hardware video acceleration
fr: Voulez-vous installer l'accéleration vidéo matérielle

source: Do you wish to install proprietary drivers
fr: Voulez-vous installer les drivers propiétaires

source: Select AUR Helper
fr: Sélectionnez un AUR Helper

source: Do you wish add to all groups user {username}
fr: Voulez-vous ajouter l'utilisateur {username} à tous les groupes

source: this action cannot be canceled !
fr: cette action ne peut pas être annulée !

source: Do you wish to install Arch Linux now
fr: Voulez-vous installer Arch Linux maintenant

source: deactivate swap partition [{swap}]
fr: désactivation de la partition swap partition [{swap}]

source: umount {partition}
fr: démontage de {partition}

source: delete {lv}
fr: suppression de {lv}

source: delete {vg}
fr: suppression de {vg}

source: delete {pv}
fr: suppression de {pv}

source: delete {partition}
fr: suppression de {partition}

source: format {drive} [{size}]
fr: formatage de {drive} [{size}]

source: create new {table} partition table on {drive}
fr: création d'une nouvelle table de partition {table} sur {drive}

source: create {partition} partition [{size}] on {drive}
fr: création de la partition {partition} [{size}] sur {drive}

source: set EFI partition type for boot partition [{drive_id}]
fr: ajout du type EFI pour la partition boot [{drive_id}]

source: set LVM partition type for root partition [{drive_id}]
fr: ajout du type LVM pour la partition root [{drive_id}]

source: create LVM on LUKS [{drive_id}]
fr: création de LVM on LUKS [{drive_id}]

source: create LVM Volume on [{drive_id}]
fr: création d'un volume LVM sur [{drive_id}]

source: create {partition} LVM partition [{size}]
fr: création d'un partition LVM pour {partition} [{size}]

source: format {partition} partition [{filesystem}] [{size}]
fr: formatage de la partition {partition} [{filesystem}] [{size}]

source: mount {partition} partition [{drive_id}] on {mountpoint}
fr: montage de la partition {partition} [{drive_id}] sur {mountpoint}
